---
kind: other
id: Properties.T:Autodesk.Revit.DB.FreeFormElement
source: html/1f1d63f4-44f8-83ab-160e-200b91f68bc1.htm
---
# FreeFormElement Properties

The id of the assembly instance to which the element belongs.